app/controllers/heroes_controller.rb

    def show
    hero = Hero.find_by(id: params[:id])
---
SELECT "heros".* FROM "heros" WHERE "heros"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]