app/controllers/hero_powers_controller.rb

    def create
        heropower = Heropower.create(heropower_params)
---
INSERT INTO "heropowers" ("strength", "power_id", "hero_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["strength", "Average"], ["power_id", 2], ["hero_id", 5], ["created_at", "2023-03-26 12:28:10.682218"], ["updated_at", "2023-03-26 12:28:10.682218"]]