app/controllers/powers_controller.rb

    def index
        powers = Power.all
---
SELECT "powers".* FROM "powers"

    def show
    powers = Power.find_by(id: params[:id])
---
SELECT "powers".* FROM "powers" WHERE "powers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def update
        powers = Power.find_by(id: params[:id])
        if powers
            powers.update(power_params)
---
SELECT "powers".* FROM "powers" WHERE "powers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "powers" SET "name" = ?, "description" = ?, "updated_at" = ? WHERE "powers"."id" = ?  [["name", "supermari"], ["description", "wiztive"], ["updated_at", "2023-03-26 11:50:29.994161"], ["id", 2]]